import numpy as np
import cv2
import matplotlib.pyplot as plt
import math


def cal_route(old, M):
    new_route = []
    for old_point in old:
        Z = M[2, 0] * old_point[0] + M[2, 1] * old_point[1] + M[2, 2]
        tempX = (M[0, 0] * old_point[0] + M[0, 1] * old_point[1] + M[0, 2]) // Z
        tempY = (M[1, 0] * old_point[0] + M[1, 1] * old_point[1] + M[1, 2]) // Z
        new_point = [int(tempX), int(tempY)]
        new_route.append(new_point)
    print(new_route)
    return new_route


def cal_perspective_params(img, points):
    offset_x = 330
    offset_y = 0
    img_size = (img.shape[1], img.shape[0])
    src = np.float32(points)
    # 俯视图中四点的位置
    dst = np.float32([[359, 400], [461, 400], [359, 542], [461, 542]])
    # 从原始图像转换为俯视图的透视变换的参数矩阵
    M = cv2.getPerspectiveTransform(src, dst)
    # 从俯视图转换为原始图像的透视变换参数矩阵
    M_inverse = cv2.getPerspectiveTransform(dst, src)
    return M, M_inverse


def img_perspect_transform(img, M):
    img_size = (img.shape[1], img.shape[0])
    return cv2.warpPerspective(img, M, img_size)


if __name__ == "__main__":
    img = cv2.imread("E:\\repos\\Vehicle-tracking\\videos\\sample2_Moment.jpg")

    old_route = [(542, 324), (540, 320), (539, 324), (537, 314), (535, 309), (533, 307), (533, 306), (531, 305),
                 (530, 303), (529, 302), (527, 294), (526, 289), (526, 287), (524, 284), (524, 282), (524, 280),
                 (523, 280), (523, 279), (523, 278), (521, 275), (520, 274), (520, 273), (518, 270), (517, 267),
                 (516, 267), (516, 266), (515, 263), (515, 260), (514, 259), (514, 256), (513, 255), (513, 254),
                 (512, 251), (511, 249), (511, 247), (510, 245), (510, 245), (510, 244), (509, 243), (509, 241),
                 (508, 240), (507, 239), (507, 240), (507, 238), (506, 236), (505, 234), (505, 232), (505, 230),
                 (505, 229), (504, 228), (503, 228), (503, 226), (502, 225), (502, 223), (502, 221), (501, 219),
                 (501, 216), (501, 214), (500, 209), (500, 204), (499, 195), (498, 193), (498, 192), (497, 191),
                 (496, 182), (496, 182), (497, 177), (497, 176), (497, 175), (498, 174), (498, 175), (498, 174),
                 (500, 174), (500, 174), (502, 175), (502, 174), (502, 173), (503, 172), (504, 169), (504, 168),
                 (505, 167), (506, 165), (510, 162), (513, 161), (514, 161), (517, 159), (518, 159), (519, 158),
                 (519, 158), (524, 154), (525, 153), (525, 152), (526, 153), (528, 153), (531, 153), (532, 153),
                 (533, 152), (536, 151), (538, 150), (540, 149), (540, 148), (541, 148), (543, 148), (544, 149),
                 (545, 148), (549, 147), (550, 146), (551, 146), (572, 137), (574, 137), (576, 137), (577, 137),
                 (578, 138), (583, 137), (585, 136), (587, 136), (588, 136), (590, 136), (592, 137), (595, 138),
                 (596, 138), (598, 138), (599, 138), (600, 136), (602, 135), (605, 136), (608, 135), (611, 135),
                 (613, 135), (614, 134), (618, 134), (620, 133), (622, 133), (625, 134), (626, 134), (628, 134),
                 (633, 135), (635, 134), (638, 134), (640, 134), (640, 134), (640, 134), (641, 133), (643, 133),
                 (646, 132), (650, 132), (650, 132), (652, 133), (657, 131), (660, 130), (664, 129), (668, 128),
                 (669, 128), (672, 128), (677, 127), (680, 127), (682, 127), (687, 126), (689, 126), (693, 126),
                 (695, 126), (696, 125), (697, 125), (699, 125), (701, 125), (703, 125), (736, 126), (741, 126),
                 (751, 124), (754, 123)]

    points = [[359, 307], [461, 306], [312, 542], [497, 542]]
    M, M_inverse = cal_perspective_params(img, points)

    new_route = cal_route(old_route, M)
    transform_img = img_perspect_transform(img, M)
    for index in range(len(new_route) - 1):
        x = new_route[index][0] - new_route[index+1][0]
        y = new_route[index][1] - new_route[index+1][1]
        dis = math.sqrt((x ** 2) + (y ** 2))
        cv2.line(transform_img, new_route[index], new_route[index + 1], (255, 0, 0), thickness=2, lineType=8)

    plt.subplot(1, 2, 1)
    plt.imshow(img[:, :, ::-1])
    plt.subplot(1, 2, 2)
    plt.imshow(transform_img[:, :, ::-1])
    plt.show()
